FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_M4_AMP_STM32H745I_Discovery_IAR/ST_code/BSP/STM32H745I-Discovery/stm32h745i_discovery_audio.c
/**
 ******************************************************************************
 * @file    stm32h745i_discovery_audio.c
 * @author  MCD Application Team
 * @brief   This file provides the Audio driver for the STM32H745I-DISCOVERY
 *          board.
 * @verbatim
 * How To use this driver:
 * -----------------------
 + This driver supports STM32H7xx devices on STM32H745I-DISCOVERY (MB1248) Discovery boards.
 + Call the function BSP_AUDIO_OUT_Init(
 +                                  OutputDevice: physical output mode (OUTPUT_DEVICE_SPEAKER,
 +                                                OUTPUT_DEVICE_HEADPHONE or OUTPUT_DEVICE_BOTH)
 +                                  Volume      : Initial volume to be set (0 is min (mute), 100 is max (100%)
 +                                  AudioFreq   : Audio frequency in Hz (8000, 16000, 22500, 32000...)
 +                                                this parameter is relative to the audio file/stream type.
 +                                 )
 +    This function configures all the hardware required for the audio application (codec, I2C, SAI,
 +    GPIOs, DMA and interrupt if needed). This function returns AUDIO_OK if configuration is OK.
 +    If the returned value is different from AUDIO_OK or the function is stuck then the communication with
 +    the codec has failed (try to un-plug the power or reset device in this case).
 +    - OUTPUT_DEVICE_SPEAKER  : only speaker will be set as output for the audio stream.
 +    - OUTPUT_DEVICE_HEADPHONE: only headphones will be set as output for the audio stream.
 +    - OUTPUT_DEVICE_BOTH     : both Speaker and Headphone are used as outputs for the audio stream
 +                               at the same time.
 +    Note. On STM32H745I-DISCOVERY SAI_DMA is configured in CIRCULAR mode. Due to this the application
 +      does NOT need to call BSP_AUDIO_OUT_ChangeBuffer() to assure streaming.
 + Call the function BSP_AUDIO_OUT_Play(
 +                                pBuffer: pointer to the audio data file address
 +                                Size   : size of the buffer to be sent in Bytes
 +                               )
 +    to start playing (for the first time) from the audio file/stream.
 + Call the function BSP_AUDIO_OUT_Pause() to pause playing
 + Call the function BSP_AUDIO_OUT_Resume() to resume playing.
 +     Note. After calling BSP_AUDIO_OUT_Pause() function for pause, only BSP_AUDIO_OUT_Resume() should be called
 +        for resume (it is not allowed to call BSP_AUDIO_OUT_Play() in this case).
 +     Note. This function should be called only when the audio file is played or paused (not stopped).
 + For each mode, you may need to implement the relative callback functions into your code.
 +    The Callback functions are named BSP_AUDIO_OUT_XXX_CallBack() and only their prototypes are declared in
 +    the stm32h745i_discovery_audio.h file. (refer to the example for more details on the callbacks implementations)
 + To Stop playing, to modify the volume level, the frequency, the audio frame slot,
 +    the device output mode the mute or the stop, use the functions: BSP_AUDIO_OUT_SetVolume(),
 +    AUDIO_OUT_SetFrequency(), BSP_AUDIO_OUT_SetAudioFrameSlot(), BSP_AUDIO_OUT_SetOutputMode(),
 +    BSP_AUDIO_OUT_SetMute() and BSP_AUDIO_OUT_Stop().
 +
 + Call the function BSP_AUDIO_IN_Init(
 +                                  AudioFreq: Audio frequency in Hz (8000, 16000, 22500, 32000...)
 +                                                this parameter is relative to the audio file/stream type.
 +                                  BitRes: Bit resolution fixed to 16bit
 +                                  ChnlNbr: Number of channel to be configured for the DFSDM peripheral
 +                                 )
 +    This function configures all the hardware required for the audio in application (channels,
 +    Clock source for SAI PDM periphiral, GPIOs, DMA and interrupt if needed).
 +    This function returns AUDIO_OK if configuration is OK.If the returned value is different from AUDIO_OK then
 +    the configuration should be wrong.
 + Call the function BSP_AUDIO_IN_AllocScratch(
 +                                      pScratch: pointer to scratch tables
 +                                      size: size of scratch buffer)
 +   This function must be called before BSP_AUDIO_IN_RECORD() to allocate buffer scratch for each DFSDM channel
 +   and its size.
 +   Note: These buffers scratch are used as intermidiate buffers to collect data within final record buffer.
 +         size is the total size of the four buffers scratch; If size is 512 then the size of each is 128.
 +         This function must be called after BSP_AUDIO_IN_Init()
 + Call the function BSP_AUDIO_IN_RECORD(
 +                                pBuf: pointer to the recorded audio data file address
 +                                Size: size of the buffer to be written in Bytes
 +                               )
 +    to start recording from microphones.
 +
 + Call the function BSP_AUDIO_IN_Pause() to pause recording
 + Call the function BSP_AUDIO_IN_Resume() to recording playing.
 +     Note. After calling BSP_AUDIO_IN_Pause() function for pause, only BSP_AUDIO_IN_Resume() should be called
 +        for resume (it is not allowed to call BSP_AUDIO_IN_RECORD() in this case).
 + Call the function BSP_AUDIO_IN_Stop() to stop recording
 + For each mode, you may need to implement the relative callback functions into your code.
 +    The Callback functions are named BSP_AUDIO_IN_XXX_CallBack() and only their prototypes are declared in
 +    the stm32h745i_discovery_audio.h file. (refer to the example for more details on the callbacks implementations)
 + Call the function BSP_AUDIO_IN_SelectInterface(uint32_t Interface) to select one of the two interfaces
 +   available on the STM32H745I-Discovery board: SAI or PDM. This function is to be called before BSP_AUDIO_IN_InitEx().
 + Call the function BSP_AUDIO_IN_GetInterface() to get the current used interface.
 + Call the function BSP_AUDIO_IN_PDMToPCM_Init(uint32_t AudioFreq, uint32_t ChnlNbrIn, uint32_t ChnlNbrOut)
 +   to init PDM filters if the libPDMFilter is used for audio data filtering.
 + Call the function BSP_AUDIO_IN_PDMToPCM(uint16_t* PDMBuf, uint16_t* PCMBuf) to filter PDM data to PCM format
 +   if the libPDMFilter library is used for audio data filtering.
 +
 + Driver architecture:
 + --------------------
 + This driver provides the High Audio Layer: consists of the function API exported in the stm32h745i_discovery_audio.h file
 +   (BSP_AUDIO_OUT_Init(), BSP_AUDIO_OUT_Play() ...)
 + This driver provide also the Media Access Layer (MAL): which consists of functions allowing to access the media containing/
 +   providing the audio file/stream. These functions are also included as local functions into
 +   the stm32h745i_discovery_audio.c file (DFSDMx_Init(), DFSDMx_DeInit(), SAIx_Init() and SAIx_DeInit())
 +
 + Known Limitations:
 + ------------------
 + 1- If the TDM Format used to play in parallel 2 audio Stream (the first Stream is configured in codec SLOT0 and second
 +    Stream in SLOT1) the Pause/Resume, volume and mute feature will control the both streams.
 + 2- Parsing of audio file is not implemented (in order to determine audio file properties: Mono/Stereo, Data size,
 +    File size, Audio Frequency, Audio Data header size ...). The configuration is fixed for the given audio file.
 + 3- Supports only Stereo audio streaming.
 + 4- Supports only 16-bits audio data size.
 + @endverbatim
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
 * All rights reserved.</center></h2>
 *
 * This software component is licensed by ST under BSD 3-Clause license,
 * the "License"; You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                        opensource.org/licenses/BSD-3-Clause
 *
 ******************************************************************************
 */
/* Includes ------------------------------------------------------------------*/
#include "stm32h745i_discovery_audio.h"

/** @addtogroup BSP
 * @{
 */

/** @addtogroup STM32H745I_DISCOVERY
 * @{
 */

/** @defgroup STM32H745I_DISCOVERY_AUDIO STM32H745I_DISCOVERY_AUDIO
 * @brief This file includes the low layer driver for wm8994 Audio Codec
 *        available on STM32H745I-DISCOVERY discovery board(MB1248).
 * @{
 */

/** @defgroup STM32H745I_DISCOVERY_AUDIO_Private_Variables Private Variables
 * @{
 */
/* PLAY */
AUDIO_DrvTypeDef * audio_drv;
SAI_HandleTypeDef haudio_out_sai;
SAI_HandleTypeDef haudio_in_sai;

/* RECORD */
AUDIOIN_ContextTypeDef hAudioIn;

/* Audio in Volume value */
__IO uint16_t AudioInVolume = DEFAULT_AUDIO_IN_VOLUME;

/* PDM filters params */
PDM_Filter_Handler_t PDM_FilterHandler[ 2 ];
PDM_Filter_Config_t PDM_FilterConfig[ 2 ];

/**
 * @}
 */

/** @defgroup STM32H745I_DISCOVERY_AUDIO_Private_Function_Prototypes OUT Private Function Prototypes
 * @{
 */
static void SAIx_Out_Init( uint32_t SaiOutMode,
                           uint32_t SlotActive,
                           uint32_t AudioFreq );
static void SAIx_Out_DeInit( SAI_HandleTypeDef * hsai );

/**
 * @}
 */

/** @defgroup STM32H745I_DISCOVERY_AUDIO_IN_Private_Function_Prototypes IN Private Function Prototypes
 * @{
 */
static void SAIx_In_MspInit( SAI_HandleTypeDef * hsai,
                             void * Params );
static void SAIx_In_MspDeInit( SAI_HandleTypeDef * hsai,
                               void * Params );
static void SAIx_In_Init( uint32_t SaiInMode,
                          uint32_t SlotActive,
                          uint32_t AudioFreq );
static void SAIx_In_DeInit( SAI_HandleTypeDef * hsai );

/**
 * @}
 */

