FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_M4_AMP_STM32H745I_Discovery_IAR/ST_code/BSP/STM32H745I-Discovery/stm32h745i_discovery_audio.c
/** @defgroup STM32H745I_DISCOVERY_AUDIO_OUT_Exported_Functions OUT Exported Functions
 * @{
 */

/**
 * @brief  Configures the audio Out peripheral.
 * @param  OutputDevice: OUTPUT_DEVICE_SPEAKER, OUTPUT_DEVICE_HEADPHONE,
 *                       or OUTPUT_DEVICE_BOTH.
 * @param  Volume: Initial volume level (from 0 (Mute) to 100 (Max))
 * @param  AudioFreq: Audio frequency used to play the audio stream.
 * @retval AUDIO_OK if correct communication, else wrong communication
 */
uint8_t BSP_AUDIO_OUT_Init( uint16_t OutputDevice,
                            uint8_t Volume,
                            uint32_t AudioFreq )
{
    uint8_t ret = AUDIO_ERROR;
    uint32_t deviceid = 0x00;
    uint32_t slot_active;

    /* Initialize SAI2 sub_block A as MASTER TX */
    haudio_out_sai.Instance = AUDIO_OUT_SAIx;

    /* Disable SAI */
    SAIx_Out_DeInit( &haudio_out_sai );

    /* PLL clock is set depending by the AudioFreq (44.1khz vs 48khz groups) */
    BSP_AUDIO_OUT_ClockConfig( &haudio_out_sai, AudioFreq, NULL );

    /* SAI data transfer preparation:
     * Prepare the Media to be used for the audio transfer from memory to SAI peripheral */

    if( HAL_SAI_GetState( &haudio_out_sai ) == HAL_SAI_STATE_RESET )
    {
        /* Init the SAI MSP: this __weak function can be redefined by the application*/
        BSP_AUDIO_OUT_MspInit( &haudio_out_sai, NULL );
    }

    /* Init SAI as master RX output */
    slot_active = CODEC_AUDIOFRAME_SLOT_0123;
    SAIx_Out_Init( SAI_MODEMASTER_TX, slot_active, AudioFreq );

    /* wm8994 codec initialization */
    deviceid = wm8994_drv.ReadID( AUDIO_I2C_ADDRESS );

    if( ( deviceid ) == WM8994_ID )
    {
        /* Reset the Codec Registers */
        wm8994_drv.Reset( AUDIO_I2C_ADDRESS );
        /* Initialize the audio driver structure */
        audio_drv = &wm8994_drv;
        ret = AUDIO_OK;
    }
    else
    {
        ret = AUDIO_ERROR;
    }

    if( ret == AUDIO_OK )
    {
        /* Initialize the codec internal registers */
        audio_drv->Init( AUDIO_I2C_ADDRESS, OutputDevice, Volume, AudioFreq );
    }

    return ret;
}

/**
 * @brief  Starts playing audio stream from a data buffer for a determined size.
 * @param  pBuffer: Pointer to the buffer
 * @param  Size: Number of audio data BYTES.
 * @retval AUDIO_OK if correct communication, else wrong communication
 */
uint8_t BSP_AUDIO_OUT_Play( uint16_t * pBuffer,
                            uint32_t Size )
{
    /* Call the audio Codec Play function */
    if( audio_drv->Play( AUDIO_I2C_ADDRESS, pBuffer, Size ) != 0 )
    {
        return AUDIO_ERROR;
    }
    else
    {
        /* Update the Media layer and enable it for play */
        HAL_SAI_Transmit_DMA( &haudio_out_sai, ( uint8_t * ) pBuffer, DMA_MAX( Size / AUDIODATA_SIZE ) );

        return AUDIO_OK;
    }
}

/**
 * @brief  Sends n-Bytes on the SAI interface.
 * @param  pData: pointer on data address
 * @param  Size: number of data to be written
 * @retval None
 */
void BSP_AUDIO_OUT_ChangeBuffer( uint16_t * pData,
                                 uint16_t Size )
{
    HAL_SAI_Transmit_DMA( &haudio_out_sai, ( uint8_t * ) pData, Size );
}

/**
 * @brief  This function Pauses the audio file stream. In case
 *         of using DMA, the DMA Pause feature is used.
 * @warning When calling BSP_AUDIO_OUT_Pause() function for pause, only
 *          BSP_AUDIO_OUT_Resume() function should be called for resume (use of BSP_AUDIO_OUT_Play()
 *          function for resume could lead to unexpected behaviour).
 * @retval AUDIO_OK if correct communication, else wrong communication
 */
uint8_t BSP_AUDIO_OUT_Pause( void )
{
    /* Call the Audio Codec Pause/Resume function */
    if( audio_drv->Pause( AUDIO_I2C_ADDRESS ) != 0 )
    {
        return AUDIO_ERROR;
    }
    else
    {
        /* Call the Media layer pause function */
        HAL_SAI_DMAPause( &haudio_out_sai );

        /* Return AUDIO_OK when all operations are correctly done */
        return AUDIO_OK;
    }
}

/**
 * @brief   Resumes the audio file stream.
 * @warning When calling BSP_AUDIO_OUT_Pause() function for pause, only
 *          BSP_AUDIO_OUT_Resume() function should be called for resume (use of BSP_AUDIO_OUT_Play()
 *          function for resume could lead to unexpected behaviour).
 * @retval AUDIO_OK if correct communication, else wrong communication
 */
uint8_t BSP_AUDIO_OUT_Resume( void )
{
    /* Call the Audio Codec Pause/Resume function */
    if( audio_drv->Resume( AUDIO_I2C_ADDRESS ) != 0 )
    {
        return AUDIO_ERROR;
    }
    else
    {
        /* Call the Media layer pause/resume function */
        HAL_SAI_DMAResume( &haudio_out_sai );

        /* Return AUDIO_OK when all operations are correctly done */
        return AUDIO_OK;
    }
}

/**
 * @brief  Stops audio playing and Power down the Audio Codec.
 * @param  Option: could be one of the following parameters
 *           - CODEC_PDWN_SW: for software power off (by writing registers).
 *                            Then no need to reconfigure the Codec after power on.
 *           - CODEC_PDWN_HW: completely shut down the codec (physically).
 *                            Then need to reconfigure the Codec after power on.
 * @retval AUDIO_OK if correct communication, else wrong communication
 */
uint8_t BSP_AUDIO_OUT_Stop( uint32_t Option )
{
    /* Call the Media layer stop function */
    HAL_SAI_DMAStop( &haudio_out_sai );

    /* Call Audio Codec Stop function */
    if( audio_drv->Stop( AUDIO_I2C_ADDRESS, Option ) != 0 )
    {
        return AUDIO_ERROR;
    }
    else
    {
        if( Option == CODEC_PDWN_HW )
        {
            /* Wait at least 100us */
            HAL_Delay( 1 );
        }

        /* Return AUDIO_OK when all operations are correctly done */
        return AUDIO_OK;
    }
}

/**
 * @brief  Controls the current audio volume level.
 * @param  Volume: Volume level to be set in percentage from 0% to 100% (0 for
 *         Mute and 100 for Max volume level).
 * @retval AUDIO_OK if correct communication, else wrong communication
 */
uint8_t BSP_AUDIO_OUT_SetVolume( uint8_t Volume )
{
    /* Call the codec volume control function with converted volume value */
    if( audio_drv->SetVolume( AUDIO_I2C_ADDRESS, Volume ) != 0 )
    {
        return AUDIO_ERROR;
    }
    else
    {
        /* Return AUDIO_OK when all operations are correctly done */
        return AUDIO_OK;
    }
}

/**
 * @brief  Enables or disables the MUTE mode by software
 * @param  Cmd: Could be AUDIO_MUTE_ON to mute sound or AUDIO_MUTE_OFF to
 *         unmute the codec and restore previous volume level.
 * @retval AUDIO_OK if correct communication, else wrong communication
 */
uint8_t BSP_AUDIO_OUT_SetMute( uint32_t Cmd )
{
    /* Call the Codec Mute function */
    if( audio_drv->SetMute( AUDIO_I2C_ADDRESS, Cmd ) != 0 )
    {
        return AUDIO_ERROR;
    }
    else
    {
        /* Return AUDIO_OK when all operations are correctly done */
        return AUDIO_OK;
    }
}

/**
 * @brief  Switch dynamically (while audio file is played) the output target
 *         (speaker or headphone).
 * @param  Output: The audio output target: OUTPUT_DEVICE_SPEAKER,
 *         OUTPUT_DEVICE_HEADPHONE or OUTPUT_DEVICE_BOTH
 * @retval AUDIO_OK if correct communication, else wrong communication
 */
uint8_t BSP_AUDIO_OUT_SetOutputMode( uint8_t Output )
{
    /* Call the Codec output device function */
    if( audio_drv->SetOutputMode( AUDIO_I2C_ADDRESS, Output ) != 0 )
    {
        return AUDIO_ERROR;
    }
    else
    {
        /* Return AUDIO_OK when all operations are correctly done */
        return AUDIO_OK;
    }
}

/**
 * @brief  Updates the audio frequency.
 * @param  AudioFreq: Audio frequency used to play the audio stream.
 * @note   This API should be called after the BSP_AUDIO_OUT_Init() to adjust the
 *         audio frequency.
 * @retval None
 */
void BSP_AUDIO_OUT_SetFrequency( uint32_t AudioFreq )
{
    /* PLL clock is set depending by the AudioFreq (44.1khz vs 48khz groups) */
    BSP_AUDIO_OUT_ClockConfig( &haudio_out_sai, AudioFreq, NULL );

