FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_M4_AMP_STM32H745I_Discovery_IAR/ST_code/BSP/STM32H745I-Discovery/stm32h745i_discovery_audio.c
    /* Disable SAI peripheral to allow access to SAI internal registers */
    __HAL_SAI_DISABLE( &haudio_out_sai );

    /* Update the SAI audio frequency configuration */
    haudio_out_sai.Init.AudioFrequency = AudioFreq;
    HAL_SAI_Init( &haudio_out_sai );

    /* Enable SAI peripheral to generate MCLK */
    __HAL_SAI_ENABLE( &haudio_out_sai );
}

/**
 * @brief  Updates the Audio frame slot configuration.
 * @param  AudioFrameSlot: specifies the audio Frame slot
 * @note   This API should be called after the BSP_AUDIO_OUT_Init() to adjust the
 *         audio frame slot.
 * @retval None
 */
void BSP_AUDIO_OUT_SetAudioFrameSlot( uint32_t AudioFrameSlot )
{
    /* Disable SAI peripheral to allow access to SAI internal registers */
    __HAL_SAI_DISABLE( &haudio_out_sai );

    /* Update the SAI audio frame slot configuration */
    haudio_out_sai.SlotInit.SlotActive = AudioFrameSlot;
    HAL_SAI_Init( &haudio_out_sai );

    /* Enable SAI peripheral to generate MCLK */
    __HAL_SAI_ENABLE( &haudio_out_sai );
}

/**
 * @brief  De-initializes the audio out peripheral.
 * @retval None
 */
void BSP_AUDIO_OUT_DeInit( void )
{
    SAIx_Out_DeInit( &haudio_out_sai );
    /* DeInit the SAI MSP : this __weak function can be rewritten by the application */
    BSP_AUDIO_OUT_MspDeInit( &haudio_out_sai, NULL );
}

/**
 * @brief  Manages the DMA full Transfer complete event.
 * @retval None
 */
__weak void BSP_AUDIO_OUT_TransferComplete_CallBack( void )
{
}

/**
 * @brief  Manages the DMA Half Transfer complete event.
 * @retval None
 */
__weak void BSP_AUDIO_OUT_HalfTransfer_CallBack( void )
{
}

/**
 * @brief  Manages the DMA FIFO error event.
 * @retval None
 */
__weak void BSP_AUDIO_OUT_Error_CallBack( void )
{
}

/**
 * @brief  Initializes BSP_AUDIO_OUT MSP.
 * @param  hsai: SAI handle
 * @param  Params: pointer on additional configuration parameters, can be NULL.
 * @retval None
 */
__weak void BSP_AUDIO_OUT_MspInit( SAI_HandleTypeDef * hsai,
                                   void * Params )
{
    static DMA_HandleTypeDef hdma_sai_tx;
    GPIO_InitTypeDef gpio_init_structure;

    /* Enable SAI clock */
    AUDIO_OUT_SAIx_CLK_ENABLE();

    /* CODEC_SAI pins configuration: FS, SCK and SD pins */
    /* Enable FS, SCK and SD clocks */
    AUDIO_OUT_SAIx_SD_FS_CLK_ENABLE();
    /* Enable FS, SCK and SD pins */
    gpio_init_structure.Pin = AUDIO_OUT_SAIx_FS_PIN | AUDIO_OUT_SAIx_SCK_PIN | AUDIO_OUT_SAIx_SD_PIN;
    gpio_init_structure.Mode = GPIO_MODE_AF_PP;
    gpio_init_structure.Pull = GPIO_NOPULL;
    gpio_init_structure.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    gpio_init_structure.Alternate = AUDIO_OUT_SAIx_AF;
    HAL_GPIO_Init( AUDIO_OUT_SAIx_SD_FS_SCK_GPIO_PORT, &gpio_init_structure );

    /* Enable MCLK clock */
    AUDIO_OUT_SAIx_MCLK_ENABLE();
    /* Enable MCLK pin */
    gpio_init_structure.Pin = AUDIO_OUT_SAIx_MCLK_PIN;
    HAL_GPIO_Init( AUDIO_OUT_SAIx_MCLK_GPIO_PORT, &gpio_init_structure );

    /* Enable the DMA clock */
    AUDIO_OUT_SAIx_DMAx_CLK_ENABLE();

    if( hsai->Instance == AUDIO_OUT_SAIx )
    {
        /* Configure the hdma_saiTx handle parameters */
        hdma_sai_tx.Init.Request = AUDIO_OUT_SAIx_DMAx_REQUEST;
        hdma_sai_tx.Init.Direction = DMA_MEMORY_TO_PERIPH;
        hdma_sai_tx.Init.PeriphInc = DMA_PINC_DISABLE;
        hdma_sai_tx.Init.MemInc = DMA_MINC_ENABLE;
        hdma_sai_tx.Init.PeriphDataAlignment = AUDIO_OUT_SAIx_DMAx_PERIPH_DATA_SIZE;
        hdma_sai_tx.Init.MemDataAlignment = AUDIO_OUT_SAIx_DMAx_MEM_DATA_SIZE;
        hdma_sai_tx.Init.Mode = DMA_CIRCULAR;
        hdma_sai_tx.Init.Priority = DMA_PRIORITY_HIGH;
        hdma_sai_tx.Init.FIFOMode = DMA_FIFOMODE_ENABLE;
        hdma_sai_tx.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
        hdma_sai_tx.Init.MemBurst = DMA_MBURST_SINGLE;
        hdma_sai_tx.Init.PeriphBurst = DMA_PBURST_SINGLE;

        hdma_sai_tx.Instance = AUDIO_OUT_SAIx_DMAx_STREAM;

        /* Associate the DMA handle */
        __HAL_LINKDMA( hsai, hdmatx, hdma_sai_tx );

        /* Deinitialize the Stream for new transfer */
        HAL_DMA_DeInit( &hdma_sai_tx );

        /* Configure the DMA Stream */
        HAL_DMA_Init( &hdma_sai_tx );
    }

    /* SAI DMA IRQ Channel configuration */
    HAL_NVIC_SetPriority( AUDIO_OUT_SAIx_DMAx_IRQ, AUDIO_OUT_IRQ_PREPRIO, 0 );
    HAL_NVIC_EnableIRQ( AUDIO_OUT_SAIx_DMAx_IRQ );
}

/**
 * @brief  Deinitializes SAI MSP.
 * @param  hsai: SAI handle
 * @param  Params: pointer on additional configuration parameters, can be NULL.
 * @retval None
 */
__weak void BSP_AUDIO_OUT_MspDeInit( SAI_HandleTypeDef * hsai,
                                     void * Params )
{
    GPIO_InitTypeDef gpio_init_structure;

    /* SAI DMA IRQ Channel deactivation */
    HAL_NVIC_DisableIRQ( AUDIO_OUT_SAIx_DMAx_IRQ );

    if( hsai->Instance == AUDIO_OUT_SAIx )
    {
        /* Deinitialize the DMA stream */
        HAL_DMA_DeInit( hsai->hdmatx );
    }

    /* Disable SAI peripheral */
    __HAL_SAI_DISABLE( hsai );

    /* Deactivates CODEC_SAI pins FS, SCK, MCK and SD by putting them in input mode */
    gpio_init_structure.Pin = AUDIO_OUT_SAIx_FS_PIN | AUDIO_OUT_SAIx_SCK_PIN | AUDIO_OUT_SAIx_SD_PIN;
    HAL_GPIO_DeInit( AUDIO_OUT_SAIx_SD_FS_SCK_GPIO_PORT, gpio_init_structure.Pin );

    gpio_init_structure.Pin = AUDIO_OUT_SAIx_MCLK_PIN;
    HAL_GPIO_DeInit( AUDIO_OUT_SAIx_MCLK_GPIO_PORT, gpio_init_structure.Pin );

    /* Disable SAI clock */
    AUDIO_OUT_SAIx_CLK_DISABLE();

    /* GPIO pins clock and DMA clock can be shut down in the applic
     * by surcharging this __weak function */
}

/**
 * @brief  Clock Config.
 * @param  hsai: might be required to set audio peripheral predivider if any.
 * @param  AudioFreq: Audio frequency used to play the audio stream.
 * @param  Params: pointer on additional configuration parameters, can be NULL.
 * @note   This API is called by BSP_AUDIO_OUT_Init() and BSP_AUDIO_OUT_SetFrequency()
 *         Being __weak it can be overwritten by the application
 * @retval None
 */
__weak void BSP_AUDIO_OUT_ClockConfig( SAI_HandleTypeDef * hsai,
                                       uint32_t AudioFreq,
                                       void * Params )
{
    RCC_PeriphCLKInitTypeDef rcc_ex_clk_init_struct;

    HAL_RCCEx_GetPeriphCLKConfig( &rcc_ex_clk_init_struct );

    /* Set the PLL configuration according to the audio frequency */
    if( ( AudioFreq == AUDIO_FREQUENCY_11K ) || ( AudioFreq == AUDIO_FREQUENCY_22K ) || ( AudioFreq == AUDIO_FREQUENCY_44K ) )
    {
        /* SAI clock config:
         * PLL2_VCO Input = HSE_VALUE/PLL2M = 1 Mhz
         * PLL2_VCO Output = PLL2_VCO Input * PLL2N = 429 Mhz
         * SAI_CLK_x = PLL2_VCO Output/PLL2P = 429/38 = 11.289 Mhz */
        rcc_ex_clk_init_struct.PeriphClockSelection = RCC_PERIPHCLK_SAI2;
        rcc_ex_clk_init_struct.Sai23ClockSelection = RCC_SAI2CLKSOURCE_PLL2;
        rcc_ex_clk_init_struct.PLL2.PLL2P = 38;
        rcc_ex_clk_init_struct.PLL2.PLL2Q = 1;
        rcc_ex_clk_init_struct.PLL2.PLL2R = 1;
        rcc_ex_clk_init_struct.PLL2.PLL2N = 429;
        rcc_ex_clk_init_struct.PLL2.PLL2M = 25;
        HAL_RCCEx_PeriphCLKConfig( &rcc_ex_clk_init_struct );
    }
    else /* AUDIO_FREQUENCY_8K, AUDIO_FREQUENCY_16K, AUDIO_FREQUENCY_48K, AUDIO_FREQUENCY_96K */
    {
        /* SAI clock config:
         * PLL2_VCO Input = HSE_VALUE/PLL2M = 1 Mhz
         * PLL2_VCO Output = PLL2_VCO Input * PLL2N = 344 Mhz
         * SAI_CLK_x = PLL2_VCO Output/PLL2P = 344/7 = 49.142 Mhz */
        rcc_ex_clk_init_struct.PeriphClockSelection = RCC_PERIPHCLK_SAI2;
        rcc_ex_clk_init_struct.Sai23ClockSelection = RCC_SAI2CLKSOURCE_PLL2;
        rcc_ex_clk_init_struct.PLL2.PLL2P = 7;
        rcc_ex_clk_init_struct.PLL2.PLL2Q = 1;
        rcc_ex_clk_init_struct.PLL2.PLL2R = 1;
        rcc_ex_clk_init_struct.PLL2.PLL2N = 344;
        rcc_ex_clk_init_struct.PLL2.PLL2M = 25;
        HAL_RCCEx_PeriphCLKConfig( &rcc_ex_clk_init_struct );
    }
}

/**
 * @}
 */

