FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_M4_AMP_STM32H745I_Discovery_IAR/ST_code/BSP/STM32H745I-Discovery/stm32h745i_discovery_audio.c
/** @defgroup STM32H745I_DISCOVERY_AUDIO_OUT_Private_Functions OUT Private Functions
 * @{
 */

/*******************************************************************************
*                           HAL Callbacks
*******************************************************************************/

/**
 * @brief  Tx Transfer completed callbacks.
 * @param  hsai: SAI handle
 * @retval None
 */
void HAL_SAI_TxCpltCallback( SAI_HandleTypeDef * hsai )
{
    /* Manage the remaining file size and new address offset: This function
     * should be coded by user (its prototype is already declared in stm32h745i_discovery_audio.h) */
    BSP_AUDIO_OUT_TransferComplete_CallBack();
}

/**
 * @brief  Tx Half Transfer completed callbacks.
 * @param  hsai: SAI handle
 * @retval None
 */
void HAL_SAI_TxHalfCpltCallback( SAI_HandleTypeDef * hsai )
{
    /* Manage the remaining file size and new address offset: This function
     * should be coded by user (its prototype is already declared in stm32h745i_discovery_audio.h) */
    BSP_AUDIO_OUT_HalfTransfer_CallBack();
}

/**
 * @brief  SAI error callbacks.
 * @param  hsai: SAI handle
 * @retval None
 */
void HAL_SAI_ErrorCallback( SAI_HandleTypeDef * hsai )
{
    if( hsai->Instance == AUDIO_OUT_SAIx )
    {
        BSP_AUDIO_OUT_Error_CallBack();
    }
    else
    {
        BSP_AUDIO_IN_Error_CallBack();
    }
}

/*******************************************************************************
*                           Static Functions
*******************************************************************************/

/**
 * @brief  Initializes the Audio Codec audio interface (SAI).
 * @param  SaiOutMode: Audio mode to be configured for the SAI peripheral.
 * @param  SlotActive: Audio active slot to be configured for the SAI peripheral.
 * @param  AudioFreq: Audio frequency to be configured for the SAI peripheral.
 * @note   The default SlotActive configuration is set to CODEC_AUDIOFRAME_SLOT_0123
 *         and user can update this configuration using
 * @retval None
 */
static void SAIx_Out_Init( uint32_t SaiOutMode,
                           uint32_t SlotActive,
                           uint32_t AudioFreq )
{
    /* Disable SAI peripheral to allow access to SAI internal registers */
    __HAL_SAI_DISABLE( &haudio_out_sai );

    /* Configure SAI_Block_x
     * LSBFirst: Disabled
     * DataSize: 16 */
    haudio_out_sai.Init.MonoStereoMode = SAI_STEREOMODE;
    haudio_out_sai.Init.AudioFrequency = AudioFreq;
    haudio_out_sai.Init.AudioMode = SaiOutMode;
    haudio_out_sai.Init.NoDivider = SAI_MASTERDIVIDER_ENABLE;
    haudio_out_sai.Init.Protocol = SAI_FREE_PROTOCOL;
    haudio_out_sai.Init.DataSize = SAI_DATASIZE_16;
    haudio_out_sai.Init.FirstBit = SAI_FIRSTBIT_MSB;
    haudio_out_sai.Init.ClockStrobing = SAI_CLOCKSTROBING_RISINGEDGE;
    haudio_out_sai.Init.Synchro = SAI_ASYNCHRONOUS;
    haudio_out_sai.Init.OutputDrive = SAI_OUTPUTDRIVE_ENABLE;
    haudio_out_sai.Init.FIFOThreshold = SAI_FIFOTHRESHOLD_1QF;
    haudio_out_sai.Init.SynchroExt = SAI_SYNCEXT_DISABLE;
    haudio_out_sai.Init.CompandingMode = SAI_NOCOMPANDING;
    haudio_out_sai.Init.TriState = SAI_OUTPUT_NOTRELEASED;
    haudio_out_sai.Init.Mckdiv = 0;
    haudio_out_sai.Init.MckOverSampling = SAI_MCK_OVERSAMPLING_DISABLE;
    haudio_out_sai.Init.PdmInit.Activation = DISABLE;
    haudio_out_sai.Init.PdmInit.ClockEnable = 0;
    haudio_out_sai.Init.PdmInit.MicPairsNbr = 0;

    /* Configure SAI_Block_x Frame
     * Frame Length: 64
     * Frame active Length: 32
     * FS Definition: Start frame + Channel Side identification
     * FS Polarity: FS active Low
     * FS Offset: FS asserted one bit before the first bit of slot 0 */
    haudio_out_sai.FrameInit.FrameLength = 128;
    haudio_out_sai.FrameInit.ActiveFrameLength = 64;
    haudio_out_sai.FrameInit.FSDefinition = SAI_FS_CHANNEL_IDENTIFICATION;
    haudio_out_sai.FrameInit.FSPolarity = SAI_FS_ACTIVE_LOW;
    haudio_out_sai.FrameInit.FSOffset = SAI_FS_BEFOREFIRSTBIT;

    /* Configure SAI Block_x Slot
     * Slot First Bit Offset: 0
     * Slot Size  : 16
     * Slot Number: 4
     * Slot Active: All slot actives */
    haudio_out_sai.SlotInit.FirstBitOffset = 0;
    haudio_out_sai.SlotInit.SlotSize = SAI_SLOTSIZE_DATASIZE;
    haudio_out_sai.SlotInit.SlotNumber = 4;
    haudio_out_sai.SlotInit.SlotActive = SlotActive;
    HAL_SAI_Init( &haudio_out_sai );

    /* Enable SAI peripheral to generate MCLK */
    __HAL_SAI_ENABLE( &haudio_out_sai );
}

/**
 * @brief  Deinitializes the Audio Codec audio interface (SAI).
 * @retval None
 */
static void SAIx_Out_DeInit( SAI_HandleTypeDef * hsai )
{
    /* Disable SAI peripheral */
    __HAL_SAI_DISABLE( hsai );

    HAL_SAI_DeInit( hsai );
}

/**
 * @}
 */

/** @defgroup STM32H745I_DISCOVERY_AUDIO_IN_Exported_Functions IN Exported Functions
 * @{
 */

/**
 * @brief  Initialize wave recording.
 * @param  AudioFreq: Audio frequency to be configured for the DFSDM peripheral.
 * @param  BitRes: Audio frequency to be configured for the DFSDM peripheral.
 * @param  ChnlNbr: Audio frequency to be configured for the DFSDM peripheral.
 * @retval AUDIO_OK if correct communication, else wrong communication
 */
uint8_t BSP_AUDIO_IN_Init( uint32_t AudioFreq,
                           uint32_t BitRes,
                           uint32_t ChnlNbr )
{
    /* Set audio in interface to default one */
    BSP_AUDIO_IN_SelectInterface( AUDIO_IN_INTERFACE_PDM );
    return BSP_AUDIO_IN_InitEx( INPUT_DEVICE_DIGITAL_MIC, AudioFreq, BitRes, ChnlNbr );
}

/**
 * @brief  Initialize wave recording.
 * @param  InputDevice: INPUT_DEVICE_DIGITAL_MIC or INPUT_DEVICE_ANALOG_MIC.
 * @param  AudioFreq: Audio frequency to be configured.
 * @param  BitRes: Audio bit resolution to be configured..
 * @param  ChnlNbr: Number of channel to be configured.
 * @retval AUDIO_OK if correct communication, else wrong communication
 */
uint8_t BSP_AUDIO_IN_InitEx( uint16_t InputDevice,
                             uint32_t AudioFreq,
                             uint32_t BitRes,
                             uint32_t ChnlNbr )
{
    uint8_t ret = AUDIO_OK;
    uint32_t slot_active;

    /* Store the audio record context */
    hAudioIn.Frequency = AudioFreq;
    hAudioIn.BitResolution = BitRes;
    hAudioIn.InputDevice = InputDevice;
    hAudioIn.ChannelNbr = ChnlNbr;

