FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_M4_AMP_STM32H745I_Discovery_IAR/ST_code/BSP/STM32H745I-Discovery/stm32h745i_discovery_audio.c
    if( hAudioIn.InputDevice == INPUT_DEVICE_DIGITAL_MIC )
    {
        if( hAudioIn.Interface == AUDIO_IN_INTERFACE_SAI )
        {
            /* Initialize SAI2 block B as SLAVE RX synchrounous with SAI2 block A */
            haudio_in_sai.Instance = AUDIO_IN_SAIx;

            /* Disable SAI */
            SAIx_In_DeInit( &haudio_in_sai );

            /* PLL clock is set depending on the AudioFreq (44.1khz vs 48khz groups) */
            BSP_AUDIO_IN_ClockConfig( AudioFreq, NULL ); /* Clock config is shared between AUDIO IN and OUT */

            /* SAI data transfer preparation:
             * Prepare the Media to be used for the audio transfer from SAI peripheral to memory */
            if( HAL_SAI_GetState( &haudio_in_sai ) == HAL_SAI_STATE_RESET )
            {
                /* Init the SAI MSP: this __weak function can be redefined by the application*/
                BSP_AUDIO_IN_MspInit();
            }

            /* Configure SAI in master mode :
             *   - SAI2_block_B in slave RX mode synchronous from SAI2_block_A
             */
            slot_active = CODEC_AUDIOFRAME_SLOT_13;
            SAIx_In_Init( SAI_MODESLAVE_RX, slot_active, AudioFreq );
        }
        else if( hAudioIn.Interface == AUDIO_IN_INTERFACE_PDM )
        {
            /* Initialize SAI2 block A as MASTER RX */
            haudio_in_sai.Instance = AUDIO_IN_SAI_PDMx;

            /* Disable SAI */
            SAIx_In_DeInit( &haudio_in_sai );

            /* PLL clock is set depending on the AudioFreq (44.1khz vs 48khz groups) */
            BSP_AUDIO_IN_ClockConfig( AudioFreq, NULL );

            /* SAI data transfer preparation:
             * Prepare the Media to be used for the audio transfer from SAI peripheral to memory */
            /* Initialize the haudio_in_sai Instance parameter */

            if( HAL_SAI_GetState( &haudio_in_sai ) == HAL_SAI_STATE_RESET )
            {
                /* Init the SAI MSP: this __weak function can be redefined by the application*/
                BSP_AUDIO_IN_MspInit();
            }

            /* Configure SAI in master mode :
             *   - SAI4_block_A in master RX mode
             */
            slot_active = CODEC_AUDIOFRAME_SLOT_1;
            SAIx_In_Init( SAI_MODEMASTER_RX, slot_active, AudioFreq );

            if( BSP_AUDIO_IN_PDMToPCM_Init( AudioFreq, hAudioIn.ChannelNbr, hAudioIn.ChannelNbr ) != AUDIO_OK )
            {
                ret = AUDIO_ERROR;
            }
        }
        else
        {
            ret = AUDIO_ERROR;
        }
    }
    else
    {
        /* Analog Input */
        ret = AUDIO_ERROR;
    }

    /* Return AUDIO_OK when all operations are correctly done */
    return ret;
}

/**
 * @brief  Initializes wave recording and playback in parallel.
 * @param  InputDevice: INPUT_DEVICE_DIGITAL_MICROPHONE_2
 * @param  OutputDevice: OUTPUT_DEVICE_SPEAKER, OUTPUT_DEVICE_HEADPHONE,
 *                       or OUTPUT_DEVICE_BOTH.
 * @param  AudioFreq: Audio frequency to be configured for the SAI peripheral.
 * @param  BitRes: Audio frequency to be configured.
 * @param  ChnlNbr: Channel number.
 * @retval AUDIO_OK if correct communication, else wrong communication
 */
uint8_t BSP_AUDIO_IN_OUT_Init( uint32_t InputDevice,
                               uint32_t OutputDevice,
                               uint32_t AudioFreq,
                               uint32_t BitRes,
                               uint32_t ChnlNbr )
{
    uint32_t slot_active;
    uint32_t deviceid = 0, ret = AUDIO_OK;

    /* Store the audio record context */
    hAudioIn.Frequency = AudioFreq;
    hAudioIn.BitResolution = BitRes;
    hAudioIn.InputDevice = InputDevice;
    hAudioIn.ChannelNbr = ChnlNbr;

    /* Input device is Digital MIC2 and Codec interface is SAI */
    if( hAudioIn.InputDevice == INPUT_DEVICE_DIGITAL_MICROPHONE_2 )
    {
        haudio_in_sai.Instance = AUDIO_IN_SAIx;
        haudio_out_sai.Instance = AUDIO_OUT_SAIx;

        /* PLL clock is set depending on the AudioFreq (44.1khz vs 48khz groups) */
        BSP_AUDIO_OUT_ClockConfig( &haudio_in_sai, AudioFreq, NULL );

        /* SAI data transfer preparation:
         * Prepare the Media to be used for the audio transfer from SAI peripheral to memory */
        if( HAL_SAI_GetState( &haudio_in_sai ) == HAL_SAI_STATE_RESET )
        {
            /* Init the SAI MSP: this __weak function can be redefined by the application*/
            BSP_AUDIO_IN_MspInit();
        }

        /* SAI data transfer preparation:
         * Prepare the Media to be used for the audio transfer from memory to SAI peripheral */
        if( HAL_SAI_GetState( &haudio_out_sai ) == HAL_SAI_STATE_RESET )
        {
            /* Init the SAI MSP: this __weak function can be redefined by the application*/
            BSP_AUDIO_OUT_MspInit( &haudio_out_sai, NULL );
        }

        /* Configure SAI in master TX mode :
         *   - SAI2_block_A in master TX mode
         *   - SAI2_block_B in slave RX mode synchronous from SAI2_block_A
         */
        slot_active = CODEC_AUDIOFRAME_SLOT_13;
        SAIx_In_Init( SAI_MODESLAVE_RX, slot_active, AudioFreq );

        slot_active = CODEC_AUDIOFRAME_SLOT_02;
        SAIx_Out_Init( SAI_MODEMASTER_TX, slot_active, AudioFreq );

        /* wm8994 codec initialization */
        deviceid = wm8994_drv.ReadID( AUDIO_I2C_ADDRESS );

        if( ( deviceid ) == WM8994_ID )
        {
            /* Reset the Codec Registers */
            wm8994_drv.Reset( AUDIO_I2C_ADDRESS );
            /* Initialize the audio driver structure */
            audio_drv = &wm8994_drv;
            ret = AUDIO_OK;
        }
        else
        {
            ret = AUDIO_ERROR;
        }

        if( ret == AUDIO_OK )
        {
            /* Initialize the codec internal registers */
            audio_drv->Init( AUDIO_I2C_ADDRESS, InputDevice | OutputDevice, 90, AudioFreq );
        }
    }
    else
    {
        ret = AUDIO_ERROR;
    }

    /* Return AUDIO_OK when all operations are correctly done */
    return ret;
}

/**
 * @brief  Link digital mic to specified source
 * @param  Interface : Audio In interface for Digital mic. It can be:
 *                       AUDIO_IN_INTERFACE_SAI
 *                       AUDIO_IN_INTERFACE_PDM
 * @retval None
 */
void BSP_AUDIO_IN_SelectInterface( uint32_t Interface )
{
    hAudioIn.Interface = Interface;
}

/**
 * @brief  Get digital mic interface
 * @retval Digital mic interface.
 */
uint32_t BSP_AUDIO_IN_GetInterface( void )
{
    return( hAudioIn.Interface );
}

/**
 * @brief  Return audio in channel number
 * @retval Number of channel
 */
uint8_t BSP_AUDIO_IN_GetChannelNumber( void )
{
    return hAudioIn.ChannelNbr;
}

/**
 * @brief  Start audio recording.
 * @param  pBuf: Main buffer pointer for the recorded data storing
 * @param  size: Current size of the recorded buffer
 * @retval AUDIO_OK if correct communication, else wrong communication
 */
uint8_t BSP_AUDIO_IN_Record( uint16_t * pBuf,
                             uint32_t size )
{
    /* Start the process receive DMA */
    if( HAL_OK != HAL_SAI_Receive_DMA( &haudio_in_sai, ( uint8_t * ) pBuf, size ) )
    {
        return AUDIO_ERROR;
    }

    /* Return AUDIO_OK when all operations are correctly done */
    return AUDIO_OK;
}

/**
 * @brief  Stop audio recording.
 * @retval AUDIO_OK if correct communication, else wrong communication
 */
uint8_t BSP_AUDIO_IN_Stop( void )
{
    /* Call the Media layer stop function */
    HAL_SAI_DMAStop( &haudio_in_sai );

    /* Return AUDIO_OK when all operations are correctly done */
    return AUDIO_OK;
}

/**
 * @brief  Pause the audio file stream.
 * @retval AUDIO_OK if correct communication, else wrong communication
 */
uint8_t BSP_AUDIO_IN_Pause( void )
{
    if( hAudioIn.InputDevice == INPUT_DEVICE_ANALOG_MIC )
    {
        return AUDIO_ERROR;
    }
    else
    {
        /* Call the Media layer pause function */
        HAL_SAI_DMAPause( &haudio_in_sai );
    }

    /* Return AUDIO_OK when all operations are correctly done */
    return AUDIO_OK;
}

/**
 * @brief  Resume the audio file stream.
 * @retval AUDIO_OK if correct communication, else wrong communication
 */
uint8_t BSP_AUDIO_IN_Resume( void )
{
    if( hAudioIn.InputDevice == INPUT_DEVICE_ANALOG_MIC )
    {
        return AUDIO_ERROR;
    }
    else
    {
        /* Call the Media layer resume function */
        HAL_SAI_DMAResume( &haudio_in_sai );
    }

    /* Return AUDIO_OK when all operations are correctly done */
    return AUDIO_OK;
}

/**
 * @brief  Controls the audio in volume level.
 * @param  Volume: Volume level to be set in percentage from 0% to 100% (0 for
 *         Mute and 100 for Max volume level).
 * @retval AUDIO_OK if correct communication, else wrong communication
 */
uint8_t BSP_AUDIO_IN_SetVolume( uint8_t Volume )
{
    /* Set the Global variable AudioInVolume  */
    AudioInVolume = Volume;

    /* Return AUDIO_OK when all operations are correctly done */
    return AUDIO_OK;
}

/**
 * @brief  Deinit the audio IN peripherals.
 * @retval None
 */
void BSP_AUDIO_IN_DeInit( void )
{
    SAIx_In_DeInit( &haudio_in_sai );

    BSP_AUDIO_IN_MspDeInit();
}

/**
 * @brief  Initialize the PDM library.
 * @param  AudioFreq: Audio sampling frequency
 * @param  ChnlNbrIn: Number of input audio channels in the PDM buffer
 * @param  ChnlNbrOut: Number of desired output audio channels in the  resulting PCM buffer
 * @retval None
 */
uint8_t BSP_AUDIO_IN_PDMToPCM_Init( uint32_t AudioFreq,
                                    uint32_t ChnlNbrIn,
                                    uint32_t ChnlNbrOut )
{
    uint32_t index = 0;

    /* Enable CRC peripheral to unlock the PDM library */
    __HAL_RCC_CRC_CLK_ENABLE();

    for( index = 0; index < ChnlNbrIn; index++ )
    {
        /* Init PDM filters */
        PDM_FilterHandler[ index ].bit_order = PDM_FILTER_BIT_ORDER_MSB;
        PDM_FilterHandler[ index ].endianness = PDM_FILTER_ENDIANNESS_LE;
        PDM_FilterHandler[ index ].high_pass_tap = 2122358088;
        PDM_FilterHandler[ index ].out_ptr_channels = ChnlNbrOut;
        PDM_FilterHandler[ index ].in_ptr_channels = ChnlNbrIn;
        PDM_Filter_Init( ( PDM_Filter_Handler_t * ) ( &PDM_FilterHandler[ index ] ) );

        /* PDM lib config phase */
        PDM_FilterConfig[ index ].output_samples_number = AudioFreq / 1000;
        PDM_FilterConfig[ index ].mic_gain = 24;
        PDM_FilterConfig[ index ].decimation_factor = PDM_FILTER_DEC_FACTOR_64;
        PDM_Filter_setConfig( ( PDM_Filter_Handler_t * ) &PDM_FilterHandler[ index ], &PDM_FilterConfig[ index ] );
    }

