FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_M4_AMP_STM32H745I_Discovery_IAR/ST_code/BSP/STM32H745I-Discovery/stm32h745i_discovery_audio.c
    return AUDIO_OK;
}


/**
 * @brief  Converts audio format from PDM to PCM.
 * @param  PDMBuf: Pointer to PDM buffer data
 * @param  PCMBuf: Pointer to PCM buffer data
 * @retval AUDIO_OK in case of success, AUDIO_ERROR otherwise
 */
uint8_t BSP_AUDIO_IN_PDMToPCM( uint16_t * PDMBuf,
                               uint16_t * PCMBuf )
{
    uint32_t index = 0;

    for( index = 0; index < hAudioIn.ChannelNbr; index++ )
    {
        PDM_Filter( &( ( uint8_t * ) ( PDMBuf ) )[ index ], ( uint16_t * ) &( PCMBuf[ index ] ), &PDM_FilterHandler[ index ] );
    }

    return AUDIO_OK;
}

/**
 * @brief  User callback when record buffer is filled.
 * @retval None
 */
__weak void BSP_AUDIO_IN_TransferComplete_CallBack( void )
{
    /* This function should be implemented by the user application.
     * It is called into this driver when the current buffer is filled
     * to prepare the next buffer pointer and its size. */
}

/**
 * @brief  Manages the DMA Half Transfer complete event.
 * @retval None
 */
__weak void BSP_AUDIO_IN_HalfTransfer_CallBack( void )
{
    /* This function should be implemented by the user application.
     * It is called into this driver when the current buffer is filled
     * to prepare the next buffer pointer and its size. */
}

/**
 * @brief  User callback when record buffer is filled.
 * @param  InputDevice: INPUT_DEVICE_DIGITAL_MIC1 or INPUT_DEVICE_DIGITAL_MIC2
 */
__weak void BSP_AUDIO_IN_TransferComplete_CallBackEx( uint32_t InputDevice )
{
    /* This function should be implemented by the user application.
     * It is called into this driver when the current buffer is filled
     * to prepare the next buffer pointer and its size. */
}

/**
 * @brief  User callback when record buffer is filled.
 * @param InputDevice: INPUT_DEVICE_DIGITAL_MIC1 or INPUT_DEVICE_DIGITAL_MIC2
 */
__weak void BSP_AUDIO_IN_HalfTransfer_CallBackEx( uint32_t InputDevice )
{
    /* This function should be implemented by the user application.
     * It is called into this driver when the current buffer is filled
     * to prepare the next buffer pointer and its size. */
}

/**
 * @brief  Audio IN Error callback function.
 * @retval None
 */
__weak void BSP_AUDIO_IN_Error_CallBack( void )
{
    /* This function is called when an Interrupt due to transfer error on or peripheral
     * error occurs. */
}

/**
 * @brief  Initialize BSP_AUDIO_IN MSP.
 * @retval None
 */
__weak void BSP_AUDIO_IN_MspInit( void )
{
    SAIx_In_MspInit( &haudio_in_sai, NULL );
}

/**
 * @brief  DeInitialize BSP_AUDIO_IN MSP.
 * @retval None
 */
__weak void BSP_AUDIO_IN_MspDeInit( void )
{
    SAIx_In_MspDeInit( &haudio_in_sai, NULL );
}

/**
 * @brief  Clock Config.
 * @param  AudioFreq: Audio frequency used to play the audio stream.
 * @param  Params: pointer on additional configuration parameters, can be NULL.
 * @note   This API is called by BSP_AUDIO_IN_Init()
 *         Being __weak it can be overwritten by the application
 * @retval None
 */
__weak void BSP_AUDIO_IN_ClockConfig( uint32_t AudioFreq,
                                      void * Params )
{
    RCC_PeriphCLKInitTypeDef rcc_ex_clk_init_struct;

    HAL_RCCEx_GetPeriphCLKConfig( &rcc_ex_clk_init_struct );

    /* Set the PLL configuration according to the audio frequency */
    if( ( AudioFreq == AUDIO_FREQUENCY_11K ) || ( AudioFreq == AUDIO_FREQUENCY_22K ) || ( AudioFreq == AUDIO_FREQUENCY_44K ) )
    {
        /* SAI clock config:
         * PLL2_VCO Input = HSE_VALUE/PLL2M = 1 Mhz
         * PLL2_VCO Output = PLL2_VCO Input * PLL2N = 429 Mhz
         * SAI_CLK_x = PLL2_VCO Output/PLL2P = 429/38 = 11.289 Mhz */
        rcc_ex_clk_init_struct.PeriphClockSelection = RCC_PERIPHCLK_SAI2;
        rcc_ex_clk_init_struct.Sai23ClockSelection = RCC_SAI2CLKSOURCE_PLL2;
        rcc_ex_clk_init_struct.PLL2.PLL2P = 38;
        rcc_ex_clk_init_struct.PLL2.PLL2Q = 1;
        rcc_ex_clk_init_struct.PLL2.PLL2R = 1;
        rcc_ex_clk_init_struct.PLL2.PLL2N = 429;
        rcc_ex_clk_init_struct.PLL2.PLL2M = 25;

        if( hAudioIn.Interface == AUDIO_IN_INTERFACE_PDM )
        {
            rcc_ex_clk_init_struct.PeriphClockSelection = RCC_PERIPHCLK_SAI4A;
            rcc_ex_clk_init_struct.Sai4AClockSelection = RCC_SAI4ACLKSOURCE_PLL2;
        }

        HAL_RCCEx_PeriphCLKConfig( &rcc_ex_clk_init_struct );
    }
    else /* AUDIO_FREQUENCY_8K, AUDIO_FREQUENCY_16K, AUDIO_FREQUENCY_32K, AUDIO_FREQUENCY_48K, AUDIO_FREQUENCY_96K */
    {
        /* SAI clock config:
         * PLL2_VCO Input = HSE_VALUE/PLL2M = 1 Mhz
         * PLL2_VCO Output = PLL2_VCO Input * PLL2N = 344 Mhz
         * SAI_CLK_x = PLL2_VCO Output/PLL2P = 344/7 = 49.142 Mhz */
        rcc_ex_clk_init_struct.PeriphClockSelection = RCC_PERIPHCLK_SAI2;
        rcc_ex_clk_init_struct.Sai23ClockSelection = RCC_SAI2CLKSOURCE_PLL2;
        rcc_ex_clk_init_struct.PLL2.PLL2P = 7;
        rcc_ex_clk_init_struct.PLL2.PLL2Q = 1;
        rcc_ex_clk_init_struct.PLL2.PLL2R = 1;
        rcc_ex_clk_init_struct.PLL2.PLL2N = 344;
        rcc_ex_clk_init_struct.PLL2.PLL2M = 25;

        if( hAudioIn.Interface == AUDIO_IN_INTERFACE_PDM )
        {
            rcc_ex_clk_init_struct.PeriphClockSelection = RCC_PERIPHCLK_SAI4A;
            rcc_ex_clk_init_struct.Sai4AClockSelection = RCC_SAI4ACLKSOURCE_PLL2;
        }

        HAL_RCCEx_PeriphCLKConfig( &rcc_ex_clk_init_struct );
    }
}

/**
 * @}
 */


/** @defgroup STM32H745I_DISCOVERY_AUDIO_IN_Private_Functions IN Private Functions
 * @{
 */

/*******************************************************************************
*                           HAL Callbacks
*******************************************************************************/

/**
 * @brief  Half reception complete callback.
 * @param  hsai: SAI handle.
 * @retval None
 */
void HAL_SAI_RxHalfCpltCallback( SAI_HandleTypeDef * hsai )
{
    /* Manage the remaining file size and new address offset: This function should be coded by user */
    BSP_AUDIO_IN_HalfTransfer_CallBack();
}

/**
 * @brief  Reception complete callback.
 * @param  hsai: SAI handle.
 * @retval None
 */
void HAL_SAI_RxCpltCallback( SAI_HandleTypeDef * hsai )
{
    /* Call the record update function to get the next buffer to fill and its size (size is ignored) */
    BSP_AUDIO_IN_TransferComplete_CallBack();
}

