FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_M4_AMP_STM32H745I_Discovery_IAR/ST_code/BSP/STM32H745I-Discovery/stm32h745i_discovery_audio.c
/*******************************************************************************
*                           Static Functions
*******************************************************************************/

/**
 * @brief  Initializes SAI Audio IN MSP.
 * @param  hsai: SAI handle
 * @param  Params: pointer on additional configuration parameters, can be NULL.
 * @retval None
 */
static void SAIx_In_MspInit( SAI_HandleTypeDef * hsai,
                             void * Params )
{
    static DMA_HandleTypeDef hdma_sai_rx;
    GPIO_InitTypeDef gpio_init_structure;

    if( hsai->Instance == AUDIO_IN_SAI_PDMx )
    {
        /* Enable SAI clock */
        AUDIO_IN_SAI_PDMx_CLK_ENABLE();

        /* Enable PDM clock */
        AUDIO_IN_SAI_PDMx_CLK_IN_ENABLE();
        gpio_init_structure.Pin = AUDIO_IN_SAI_PDMx_CLK_IN_PIN;
        gpio_init_structure.Mode = GPIO_MODE_AF_PP;
        gpio_init_structure.Pull = GPIO_NOPULL;
        gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;
        gpio_init_structure.Alternate = AUDIO_IN_SAI_PDMx_DATA_CLK_AF;
        HAL_GPIO_Init( AUDIO_IN_SAI_PDMx_CLK_IN_PORT, &gpio_init_structure );

        /* Enable PDM data */
        AUDIO_IN_SAI_PDMx_DATA_IN_ENABLE();
        gpio_init_structure.Pull = GPIO_PULLUP;
        gpio_init_structure.Speed = GPIO_SPEED_FREQ_MEDIUM;
        gpio_init_structure.Pin = AUDIO_IN_SAI_PDMx_DATA_IN_PIN;
        HAL_GPIO_Init( AUDIO_IN_SAI_PDMx_DATA_IN_PORT, &gpio_init_structure );

        /* Enable the DMA clock */
        AUDIO_IN_SAI_PDMx_DMAx_CLK_ENABLE();

        /* Configure the hdma_sai_rx handle parameters */
        hdma_sai_rx.Init.Request = AUDIO_IN_SAI_PDMx_DMAx_REQUEST;
        hdma_sai_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
        hdma_sai_rx.Init.PeriphInc = DMA_PINC_DISABLE;
        hdma_sai_rx.Init.MemInc = DMA_MINC_ENABLE;
        hdma_sai_rx.Init.PeriphDataAlignment = AUDIO_IN_SAI_PDMx_DMAx_PERIPH_DATA_SIZE;
        hdma_sai_rx.Init.MemDataAlignment = AUDIO_IN_SAI_PDMx_DMAx_MEM_DATA_SIZE;
        hdma_sai_rx.Init.Mode = DMA_CIRCULAR;
        hdma_sai_rx.Init.Priority = DMA_PRIORITY_HIGH;
        hdma_sai_rx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
        hdma_sai_rx.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
        hdma_sai_rx.Init.MemBurst = DMA_MBURST_SINGLE;
        hdma_sai_rx.Init.PeriphBurst = DMA_MBURST_SINGLE;

        hdma_sai_rx.Instance = AUDIO_IN_SAI_PDMx_DMAx_STREAM;

        /* Associate the DMA handle */
        __HAL_LINKDMA( hsai, hdmarx, hdma_sai_rx );

        /* Deinitialize the Stream for new transfer */
        HAL_DMA_DeInit( &hdma_sai_rx );

        /* Configure the DMA Stream */
        HAL_DMA_Init( &hdma_sai_rx );

        /* SAI DMA IRQ Channel configuration */
        HAL_NVIC_SetPriority( AUDIO_IN_SAI_PDMx_DMAx_IRQ, AUDIO_IN_IRQ_PREPRIO, 0 );
        HAL_NVIC_EnableIRQ( AUDIO_IN_SAI_PDMx_DMAx_IRQ );
    }
    else
    {
        /* Enable SAI clock */
        AUDIO_IN_SAIx_CLK_ENABLE();

        /* Enable SD GPIO clock */
        AUDIO_IN_SAIx_SD_ENABLE();
        /* CODEC_SAI pin configuration: SD pin */
        gpio_init_structure.Pin = AUDIO_IN_SAIx_SD_PIN;
        gpio_init_structure.Mode = GPIO_MODE_AF_PP;
        gpio_init_structure.Pull = GPIO_NOPULL;
        gpio_init_structure.Speed = GPIO_SPEED_FREQ_HIGH;
        gpio_init_structure.Alternate = AUDIO_IN_SAIx_AF;
        HAL_GPIO_Init( AUDIO_IN_SAIx_SD_GPIO_PORT, &gpio_init_structure );

        /* Enable the DMA clock */
        AUDIO_IN_SAIx_DMAx_CLK_ENABLE();

        /* Configure the hdma_sai_rx handle parameters */
        hdma_sai_rx.Init.Request = AUDIO_IN_SAIx_DMAx_REQUEST;
        hdma_sai_rx.Init.Direction = DMA_PERIPH_TO_MEMORY;
        hdma_sai_rx.Init.PeriphInc = DMA_PINC_DISABLE;
        hdma_sai_rx.Init.MemInc = DMA_MINC_ENABLE;
        hdma_sai_rx.Init.PeriphDataAlignment = AUDIO_IN_SAIx_DMAx_PERIPH_DATA_SIZE;
        hdma_sai_rx.Init.MemDataAlignment = AUDIO_IN_SAIx_DMAx_MEM_DATA_SIZE;
        hdma_sai_rx.Init.Mode = DMA_CIRCULAR;
        hdma_sai_rx.Init.Priority = DMA_PRIORITY_HIGH;
        hdma_sai_rx.Init.FIFOMode = DMA_FIFOMODE_DISABLE;
        hdma_sai_rx.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
        hdma_sai_rx.Init.MemBurst = DMA_MBURST_SINGLE;
        hdma_sai_rx.Init.PeriphBurst = DMA_MBURST_SINGLE;

        hdma_sai_rx.Instance = AUDIO_IN_SAIx_DMAx_STREAM;

        /* Associate the DMA handle */
        __HAL_LINKDMA( hsai, hdmarx, hdma_sai_rx );

        /* Deinitialize the Stream for new transfer */
        HAL_DMA_DeInit( &hdma_sai_rx );

        /* Configure the DMA Stream */
        HAL_DMA_Init( &hdma_sai_rx );

        /* SAI DMA IRQ Channel configuration */
        HAL_NVIC_SetPriority( AUDIO_IN_SAIx_DMAx_IRQ, AUDIO_IN_IRQ_PREPRIO, 0 );
        HAL_NVIC_EnableIRQ( AUDIO_IN_SAIx_DMAx_IRQ );
    }
}

/**
 * @brief  De-Initializes SAI Audio IN MSP.
 * @param  hsai: SAI handle
 * @param  Params: pointer on additional configuration parameters, can be NULL.
 * @retval None
 */
static void SAIx_In_MspDeInit( SAI_HandleTypeDef * hsai,
                               void * Params )
{
    GPIO_InitTypeDef gpio_init_structure;

    if( hsai->Instance == AUDIO_IN_SAI_PDMx )
    {
        /* Deinitialize the DMA stream */
        HAL_DMA_Abort( hsai->hdmarx );

        HAL_SAI_DeInit( hsai );
        /* Disable SAI peripheral */
        __HAL_SAI_DISABLE( hsai );

        /* Deinitialize the DMA stream */
        HAL_DMA_DeInit( hsai->hdmarx );

        gpio_init_structure.Pin = AUDIO_IN_SAI_PDMx_CLK_IN_PIN;
        HAL_GPIO_DeInit( AUDIO_IN_SAI_PDMx_CLK_IN_PORT, gpio_init_structure.Pin );

        gpio_init_structure.Pin = AUDIO_IN_SAI_PDMx_DATA_IN_PIN;
        HAL_GPIO_DeInit( AUDIO_IN_SAI_PDMx_DATA_IN_PORT, gpio_init_structure.Pin );

        /* Disable SAI clock */
        AUDIO_IN_SAI_PDMx_CLK_DISABLE();
    }
    else
    {
        /* SAI DMA IRQ Channel deactivation */
        HAL_NVIC_DisableIRQ( AUDIO_IN_SAIx_DMAx_IRQ );

        if( hsai->Instance == AUDIO_IN_SAIx )
        {
            /* Deinitialize the DMA stream */
            HAL_DMA_DeInit( hsai->hdmatx );
        }

