FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M7_M4_AMP_STM32H745I_Discovery_IAR/ST_code/BSP/STM32H745I-Discovery/stm32h745i_discovery_audio.c
        /* Disable SAI peripheral */
        __HAL_SAI_DISABLE( hsai );

        /* Deactivates CODEC_SAI pin SD by putting them in input mode */
        gpio_init_structure.Pin = AUDIO_IN_SAIx_SD_PIN;
        HAL_GPIO_DeInit( AUDIO_IN_SAIx_SD_GPIO_PORT, gpio_init_structure.Pin );

        /* Disable SAI clock */
        AUDIO_IN_SAIx_CLK_DISABLE();
    }
}

/**
 * @brief  Initializes the Audio Codec audio interface (SAI).
 * @param  SaiInMode: Audio mode to be configured for the SAI peripheral.
 * @param  SlotActive: Audio active slot to be configured for the SAI peripheral.
 * @param  AudioFreq: Audio frequency to be configured for the SAI peripheral.
 * @retval None
 */
static void SAIx_In_Init( uint32_t SaiInMode,
                          uint32_t SlotActive,
                          uint32_t AudioFreq )
{
    /* Disable SAI peripheral to allow access to SAI internal registers */
    __HAL_SAI_DISABLE( &haudio_in_sai );

    /* Configure SAI_Block_x
     * LSBFirst: Disabled
     * DataSize: 16 */
    haudio_in_sai.Init.MonoStereoMode = SAI_STEREOMODE;
    haudio_in_sai.Init.AudioFrequency = AudioFreq;
    haudio_in_sai.Init.AudioMode = SaiInMode;
    haudio_in_sai.Init.NoDivider = SAI_MASTERDIVIDER_ENABLE;
    haudio_in_sai.Init.Protocol = SAI_FREE_PROTOCOL;
    haudio_in_sai.Init.DataSize = SAI_DATASIZE_16;
    haudio_in_sai.Init.FirstBit = SAI_FIRSTBIT_MSB;
    haudio_in_sai.Init.ClockStrobing = SAI_CLOCKSTROBING_RISINGEDGE;
    haudio_in_sai.Init.Synchro = SAI_SYNCHRONOUS;
    haudio_in_sai.Init.OutputDrive = SAI_OUTPUTDRIVE_DISABLE;
    haudio_in_sai.Init.FIFOThreshold = SAI_FIFOTHRESHOLD_1QF;
    haudio_in_sai.Init.SynchroExt = SAI_SYNCEXT_DISABLE;
    haudio_in_sai.Init.CompandingMode = SAI_NOCOMPANDING;
    haudio_in_sai.Init.TriState = SAI_OUTPUT_RELEASED;
    haudio_in_sai.Init.Mckdiv = 0;
    haudio_in_sai.Init.MckOverSampling = SAI_MCK_OVERSAMPLING_DISABLE;
    haudio_in_sai.Init.PdmInit.Activation = DISABLE;

    /* Configure SAI_Block_x Frame
     * Frame Length: 64
     * Frame active Length: 32
     * FS Definition: Start frame + Channel Side identification
     * FS Polarity: FS active Low
     * FS Offset: FS asserted one bit before the first bit of slot 0 */
    haudio_in_sai.FrameInit.FrameLength = 128;
    haudio_in_sai.FrameInit.ActiveFrameLength = 64;
    haudio_in_sai.FrameInit.FSDefinition = SAI_FS_CHANNEL_IDENTIFICATION;
    haudio_in_sai.FrameInit.FSPolarity = SAI_FS_ACTIVE_LOW;
    haudio_in_sai.FrameInit.FSOffset = SAI_FS_BEFOREFIRSTBIT;

    /* Configure SAI Block_x Slot
     * Slot First Bit Offset: 0
     * Slot Size  : 16
     * Slot Number: 4
     * Slot Active: All slot active */
    haudio_in_sai.SlotInit.FirstBitOffset = 0;
    haudio_in_sai.SlotInit.SlotSize = SAI_SLOTSIZE_DATASIZE;
    haudio_in_sai.SlotInit.SlotNumber = 4;
    haudio_in_sai.SlotInit.SlotActive = SlotActive;

    if( hAudioIn.Interface == AUDIO_IN_INTERFACE_PDM )
    {
        haudio_in_sai.Init.AudioFrequency = AudioFreq * 8;
        haudio_in_sai.Init.Synchro = SAI_ASYNCHRONOUS;
        haudio_in_sai.Init.NoDivider = SAI_MASTERDIVIDER_DISABLE;

        haudio_in_sai.Init.PdmInit.Activation = ENABLE;
        haudio_in_sai.Init.PdmInit.MicPairsNbr = 2;
        haudio_in_sai.Init.PdmInit.ClockEnable = SAI_PDM_CLOCK2_ENABLE;
        haudio_in_sai.Init.FirstBit = SAI_FIRSTBIT_LSB;
        haudio_in_sai.Init.ClockStrobing = SAI_CLOCKSTROBING_FALLINGEDGE;

        haudio_in_sai.FrameInit.FrameLength = 32;
        haudio_in_sai.FrameInit.ActiveFrameLength = 1;
        haudio_in_sai.FrameInit.FSDefinition = SAI_FS_STARTFRAME;
        haudio_in_sai.FrameInit.FSPolarity = SAI_FS_ACTIVE_HIGH;
        haudio_in_sai.FrameInit.FSOffset = SAI_FS_FIRSTBIT;

        haudio_in_sai.SlotInit.SlotNumber = 2;
        haudio_in_sai.SlotInit.SlotActive = SlotActive;
    }

    HAL_SAI_Init( &haudio_in_sai );

    /* Enable SAI peripheral */
    __HAL_SAI_ENABLE( &haudio_in_sai );
}

/**
 * @brief  Deinitializes the output Audio Codec audio interface (SAI).
 * @retval None
 */
static void SAIx_In_DeInit( SAI_HandleTypeDef * hsai )
{
    /* Disable SAI peripheral */
    __HAL_SAI_DISABLE( hsai );

    HAL_SAI_DeInit( hsai );
}

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
